
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 8 to change, 28 to destroy.</code></pre>

* Create
  * azurerm_network_security_group.dg_nsg
  * azurerm_network_security_rule.dg_allow_outbound
  * azurerm_private_dns_zone_virtual_network_link.ams_zone_link
  * azurerm_private_endpoint.ams_streamingendpoint_private_endpoint
  * azurerm_role_assignment.powerapp_appreg_sa2
  * azurerm_role_assignment.powerapp_appreg_sa_cont
  * azurerm_subnet_network_security_group_association.dg_subnet_nsg
  * module.finalsa_storage_account.azurerm_private_endpoint.this[0]
  * module.ingestsa_storage_account.azurerm_private_endpoint.this[0]
  * module.sa_storage_account.azurerm_private_endpoint.this[0]
  * module.vnet_peer_to_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_to_hub.azurerm_virtual_network_peering.target_to_initiator
* Update
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1]
  * azurerm_key_vault_secret.powerbi_dg_password[0]
  * azurerm_key_vault_secret.powerbi_dg_password[1]
  * azurerm_key_vault_secret.powerbi_dg_recovery[0]
  * azurerm_key_vault_secret.powerbi_dg_recovery[1]
  * azurerm_key_vault_secret.powerbi_dg_username[0]
  * azurerm_key_vault_secret.powerbi_dg_username[1]
  * azurerm_virtual_network_peering.from_hub
  * azurerm_virtual_network_peering.to_hub
  * random_password.powerbi_dg_password[0]
  * random_password.powerbi_dg_password[1]
  * random_string.powerbi_dg_username[0]
  * random_string.powerbi_dg_username[1]
  * module.powerBI_data_gateway[0].azurerm_key_vault_key.disk_enc_key[0]
  * module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[0].random_string.password
  * module.powerBI_data_gateway[1].azurerm_key_vault_key.disk_enc_key[0]
  * module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[1].random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.keyvault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "pre-stg"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "pre-stg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0] will be destroyed
  # (because azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm is not in configuration)
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = false -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-1-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1] will be destroyed
  # (because azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm is not in configuration)
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = false -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-2-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_key_vault_secret.powerbi_dg_password[0] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_password is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_password" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-password/790a09165bc14d96beba6d49cc1f45a6" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg1-password" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-password/versions/790a09165bc14d96beba6d49cc1f45a6" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "790a09165bc14d96beba6d49cc1f45a6" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-password" -> null
    }

  # azurerm_key_vault_secret.powerbi_dg_password[1] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_password is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_password" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-password/514d123fb4304732a365caeb3650222c" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg2-password" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-password/versions/514d123fb4304732a365caeb3650222c" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "514d123fb4304732a365caeb3650222c" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-password" -> null
    }

  # azurerm_key_vault_secret.powerbi_dg_recovery[0] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_recovery is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_recovery" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-recovery-key/38959f4472864d72995937d57b310e9e" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg1-recovery-key" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-recovery-key/versions/38959f4472864d72995937d57b310e9e" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-recovery-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "38959f4472864d72995937d57b310e9e" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-recovery-key" -> null
    }

  # azurerm_key_vault_secret.powerbi_dg_recovery[1] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_recovery is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_recovery" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-recovery-key/feda10d7a6294b3c93ce62a7727333f8" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg2-recovery-key" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-recovery-key/versions/feda10d7a6294b3c93ce62a7727333f8" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-recovery-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "feda10d7a6294b3c93ce62a7727333f8" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-recovery-key" -> null
    }

  # azurerm_key_vault_secret.powerbi_dg_username[0] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_username is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_username" {
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-username/d2d79eadbabf41008fe2f5cab0520260" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg1-username" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-username/versions/d2d79eadbabf41008fe2f5cab0520260" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg1-username" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "d2d79eadbabf41008fe2f5cab0520260" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg1-username" -> null
    }

  # azurerm_key_vault_secret.powerbi_dg_username[1] will be destroyed
  # (because azurerm_key_vault_secret.powerbi_dg_username is not in configuration)
  - resource "azurerm_key_vault_secret" "powerbi_dg_username" {
      - id                      = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-username/05957fc88ee845a4b464fe17185b9aa3" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "powerbi-dg2-username" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-username/versions/05957fc88ee845a4b464fe17185b9aa3" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/powerbi-dg2-username" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "05957fc88ee845a4b464fe17185b9aa3" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/powerbi-dg2-username" -> null
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_network_security_group.dg_nsg will be created
  + resource "azurerm_network_security_group" "dg_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dg-nsg-stg"
      + resource_group_name = "pre-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # azurerm_network_security_rule.dg_allow_outbound will be created
  + resource "azurerm_network_security_rule" "dg_allow_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
          + "5671",
          + "5672",
          + "9350-9354",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "dg_allow_outbound"
      + network_security_group_name = "dg-nsg-stg"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "pre-stg"
      + source_address_prefix       = "10.101.0.192/26"
      + source_port_range           = "*"
    }

  # azurerm_private_dns_zone_virtual_network_link.ams_zone_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "ams_zone_link" {
      + id                    = (known after apply)
      + name                  = "pre-stg-virtual-network-link"
      + private_dns_zone_name = "privatelink.media.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg"
    }

  # azurerm_private_endpoint.ams_streamingendpoint_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ams_streamingendpoint_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ams-streamingendpoint-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "ams-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.media.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ams-private-link-connection"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "streamingendpoint",
            ]
        }
    }

  # azurerm_role_assignment.powerapp_appreg_sa2 will be created
  + resource "azurerm_role_assignment" "powerapp_appreg_sa2" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                    

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 null
      - private_ip_addresses          = [
          - "10.101.0.225",
        ] -> null
      - resource_group_name           = "pre-stg" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - virtual_machine_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null

      - ip_configuration {
          - name                          = "IP_CONFIGURATION" -> null
          - primary                       = true -> null
          - private_ip_address            = "10.101.0.225" -> null
          - private_ip_address_allocation = "Static" -> null
          - private_ip_address_version    = "IPv4" -> null
          - subnet_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg" -> null
        }
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] will be destroyed
  # (because azurerm_virtual_machine_data_disk_attachment.data_disk_attachments is not in configuration)
  - resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      - caching                   = "ReadWrite" -> null
      - create_option             = "Attach" -> null
      - id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/dataDisks/powerbi-dg2-data-stg" -> null
      - lun                       = 10 -> null
      - managed_disk_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/powerbi-dg2-data-stg" -> null
      - virtual_machine_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null
      - write_accelerator_enabled = false -> null
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0] will be destroyed
  # (because azurerm_virtual_machine_extension.vmextension is not in configuration)
  - resource "azurerm_virtual_machine_extension" "vmextension" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/extensions/azure-disk-encrypt-gMLX" -> null
      - name                        = "azure-disk-encrypt-gMLX" -> null
      - publisher                   = "Microsoft.Azure.Security" -> null
      - settings                    = jsonencode(
            {
              - EncryptionOperation    = "EnableEncryption"
              - KekVaultResourceId     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
              - KeyEncryptionAlgorithm = "RSA-OAEP"
              - KeyEncryptionKeyURL    = "https://pre-stg.vault.azure.net/keys/disk-encrypt-powerbi-2-stg/ddbb5d6e9496429090cb99e12c9538d1"
              - KeyVaultResourceId     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
              - KeyVaultURL            = "https://pre-stg.vault.azure.net/"
              - VolumeType             = "All"
            }
        ) -> null
      - tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - type                        = "AzureDiskEncryption" -> null
      - type_handler_version        = "2.2" -> null
      - virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null
    }

  # module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0] will be destroyed
  # (because azurerm_windows_virtual_machine.winvm is not in configuration)
  - resource "azurerm_windows_virtual_machine" "winvm" {
      - admin_password                = (sensitive value)
      - admin_username                = (sensitive value) -> null
      - allow_extension_operations    = true -> null
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      - computer_name                 = "powerbi-2-stg" -> null
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - enable_automatic_updates      = true -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      - extensions_time_budget        = "PT1H30M" -> null
      - hotpatching_enabled           = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null
      - license_type                  = "" -> null
      - location                      = "uksouth" -> null
      - max_bid_price                 = -1 -> null
      - name                          = "powerbi-2-stg" -> null
      - network_interface_ids         = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/powerbi-dg2-nic-stg",
        ] -> null
      - patch_assessment_mode         = "ImageDefault" -> null
      - patch_mode                    = "AutomaticByOS" -> null
      - platform_fault_domain         = -1 -> null
      - priority                      = "Regular" -> null
      - private_ip_address            = "10.101.0.225" -> null
      - private_ip_addresses          = [
          - "10.101.0.225",
        ] -> null
      - provision_vm_agent            = true -> null
      - proximity_placement_group_id  = "" -> null
      - public_ip_address             = "" -> null
      - public_ip_addresses           = [] -> null
      - resource_group_name           = "pre-stg" -> null
      - secure_boot_enabled           = false -> null
      - size                          = "Standard_F8s_v2" -> null
      - source_image_id               = "" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      - virtual_machine_id            = "8c7362ca-d238-4b5a-add7-a73d291fe985" -> null
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
      - zone                          = "2" -> null

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_size_gb              = 127 -> null
          - name                      = "powerbi-2-stg_OsDisk_1_251c1340ebb843bc8c88d80f625e5313" -> null
          - storage_account_type      = "StandardSSD_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "WindowsServer" -> null
          - publisher = "MicrosoftWindowsServer" -> null
          - sku       = "2019-Datacenter-gensecond" -> null
          - version   = "latest" -> null
        }
    }

  # module.powerBI_data_gateway[1].random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "gMLX" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "gMLX" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.sa_storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "presastg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "presastg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "104.44.89.224/27",
              - "13.104.129.128/26",
              - "13.104.145.160/27",
              - "13.104.146.64/26",
              - "13.104.159.0/25",
              - "13.87.0.0/18",
              - "13.87.64.0/19",
              - "13.87.96.0/20",
              - "172.165.0.0/16",
              - "172.166.0.0/15",
              - "172.187.128.0/17",
              - "20.0.0.0/16",
              - "20.108.0.0/16",
              - "20.117.128.0/17",
              - "20.117.64.0/18",
              - "20.135.176.0/22",
              - "20.135.180.0/23",
              - "20.150.18.0/25",
              - "20.150.27.0/24",
              - "20.150.40.0/25",
              - "20.150.41.0/24",
              - "20.150.69.0/24",
              - "20.157.107.0/24",
              - "20.157.112.0/24",
              - "20.157.120.0/24",
              - "20.157.157.0/24",
              - "20.157.182.0/24",
              - "20.157.246.0/24",
              - "20.157.28.0/24",
              - "20.162.128.0/17",
              - "20.190.143.0/25",
              - "20.190.169.0/24",
              - "20.190.172.0/24",
              - "20.202.4.0/24",
              - "20.209.30.0/23",
              - "20.209.6.0/23",
              - "20.209.88.0/23",
              - "20.254.0.0/17",
              - "20.26.0.0/16",
              - "20.38.106.0/23",
              - "20.39.208.0/20",
              - "20.39.224.0/21",
              - "20.47.11.0/24",
              - "20.47.114.0/24",
              - "20.47.34.0/24",
              - "20.47.68.0/24",
              - "20.49.128.0/17",
              - "20.50.96.0/19",
              - "20.58.0.0/18",
              - "20.60.166.0/23",
              - "20.60.17.0/24",
              - "20.68.0.0/18",
              - "20.68.128.0/17",
              - "20.77.0.0/17",
              - "20.77.128.0/18",
              - "20.90.128.0/17",
              - "20.90.64.0/18",
              - "20.95.67.0/24",
              - "20.95.74.0/23",
              - "20.95.82.0/23",
              - "20.95.84.0/24",
              - "4.158.0.0/15",
              - "4.234.0.0/16",
              - "4.250.0.0/16",
              - "40.120.136.0/22",
              - "40.120.32.0/19",
              - "40.126.15.0/25",
              - "40.126.41.0/24",
              - "40.126.44.0/24",
              - "40.64.144.0/24",
              - "40.79.201.0/24",
              - "40.79.215.0/24",
              - "40.80.0.0/22",
              - "40.80.12.0/22",
              - "40.81.128.0/19",
              - "40.81.160.0/20",
              - "40.90.128.112/28",
              - "40.90.128.160/28",
              - "40.90.130.128/28",
              - "40.90.131.64/27",
              - "40.90.139.64/27",
              - "40.90.141.192/26",
              - "40.90.143.64/27",
              - "40.90.150.96/27",
              - "40.90.153.64/27",
              - "40.90.154.0/26",
              - "40.90.17.160/27",
              - "40.90.17.32/27",
              - "40.90.29.192/26",
              - "40.93.67.0/24",
              - "51.104.0.0/19",
              - "51.104.192.0/18",
              - "51.105.0.0/18",
              - "51.105.64.0/20",
              - "51.11.0.0/18",
              - "51.11.128.0/18",
              - "51.132.0.0/18",
              - "51.132.128.0/17",
              - "51.140.0.0/17",
              - "51.140.128.0/18",
              - "51.141.128.32/27",
              - "51.141.129.192/26",
              - "51.141.129.64/26",
              - "51.141.130.0/25",
              - "51.141.135.0/24",
              - "51.141.156.0/22",
              - "51.141.192.0/18",
              - "51.142.192.0/18",
              - "51.142.40.11",
              - "51.142.47.249",
              - "51.142.47.252",
              - "51.142.64.0/18",
              - "51.143.128.0/18",
              - "51.143.192.0/21",
              - "51.143.200.0/28",
              - "51.143.201.0/24",
              - "51.143.208.0/20",
              - "51.143.224.0/19",
              - "51.145.0.0/17",
              - "52.101.88.0/23",
              - "52.101.95.0/24",
              - "52.101.96.0/23",
              - "52.102.164.0/24",
              - "52.103.165.0/24",
              - "52.103.37.0/24",
              - "52.108.100.0/23",
              - "52.108.138.0/24",
              - "52.108.50.0/23",
              - "52.108.88.0/24",
              - "52.108.99.0/24",
              - "52.109.28.0/22",
              - "52.109.40.0/22",
              - "52.111.242.0/24",
              - "52.112.231.0/24",
              - "52.112.240.0/20",
              - "52.113.128.0/24",
              - "52.113.200.0/22",
              - "52.113.204.0/24",
              - "52.113.224.0/19",
              - "52.114.88.0/22",
              - "52.120.160.0/19",
              - "52.120.240.0/20",
              - "52.123.141.0/24",
              - "52.123.142.0/23",
              - "52.136.18.0/24",
              - "52.136.21.0/24",
              - "52.151.64.0/18",
              - "52.239.187.0/25",
              - "52.239.231.0/24",
              - "52.245.64.0/22",
              - "52.253.162.0/23",
            ]
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.vnet_peer_to_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub"
      + remote_virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int"
      + resource_group_name          = "pre-stg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "pre-vnet01-stg"
    }

  # module.vnet_peer_to_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "pre-recorded-evidence"
      + remote_virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg"
      + resource_group_name          = "hmcts-hub-prod-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "hmcts-hub-prod-int"
    }

Plan: 12 to add, 8 to change, 28 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":526,"Program":"tfcmt","SHA1":"","Vars":{}} -->